export default [
  {
    baGong: '乾宫属金',
    baGongOrder: 10,
    chongHe: '六冲',
    naJia: [
      '父母戌土',
      '兄弟申金',
      '官鬼午火',
      '父母辰土',
      '妻财寅木',
      '子孙子水'
    ],
    shiYing: {
      '3': '应',
      '6': '世'
    }
  },
  {
    baGong: '坤宫属土',
    baGongOrder: 80,
    chongHe: '六冲',
    naJia: [
      '子孙酉金',
      '妻财亥水',
      '兄弟丑土',
      '官鬼卯木',
      '父母巳火',
      '兄弟未土'
    ],
    shiYing: {
      '3': '应',
      '6': '世'
    }
  },
  {
    baGong: '坎宫二世',
    baGongOrder: 62,
    naJia: [
      '兄弟子水',
      '官鬼戌土',
      '父母申金',
      '官鬼辰土',
      '子孙寅木',
      '兄弟子水'
    ],
    shiYing: {
      '2': '世',
      '5': '应'
    }
  },
  {
    baGong: '离宫四世',
    baGongOrder: 34,
    naJia: [
      '父母寅木',
      '官鬼子水',
      '子孙戌土',
      '兄弟午火',
      '子孙辰土',
      '父母寅木'
    ],
    shiYing: {
      '1': '应',
      '4': '世'
    }
  },
  {
    baGong: '坤宫游魂',
    baGongOrder: 86,
    naJia: [
      '妻财子水',
      '兄弟戌土',
      '子孙申金',
      '兄弟辰土',
      '官鬼寅木',
      '妻财子水'
    ],
    shiYing: {
      '1': '应',
      '4': '世'
    }
  },
  {
    baGong: '离宫游魂',
    baGongOrder: 36,
    naJia: [
      '子孙戌土',
      '妻财申金',
      '兄弟午火',
      '兄弟午火',
      '子孙辰土',
      '父母寅木'
    ],
    shiYing: {
      '1': '应',
      '4': '世'
    }
  },
  {
    baGong: '坎宫归魂',
    baGongOrder: 67,
    naJia: [
      '父母酉金',
      '兄弟亥水',
      '官鬼丑土',
      '妻财午火',
      '官鬼辰土',
      '子孙寅木'
    ],
    shiYing: {
      '3': '世',
      '6': '应'
    }
  },
  {
    baGong: '坤宫归魂',
    baGongOrder: 87,
    naJia: [
      '妻财子水',
      '兄弟戌土',
      '子孙申金',
      '官鬼卯木',
      '父母巳火',
      '兄弟未土'
    ],
    shiYing: {
      '3': '世',
      '6': '应'
    }
  },
  {
    baGong: '巽宫一世',
    baGongOrder: 51,
    naJia: [
      '兄弟卯木',
      '子孙巳火',
      '妻财未土',
      '妻财辰土',
      '兄弟寅木',
      '父母子水'
    ],
    shiYing: {
      '1': '世',
      '4': '应'
    }
  },
  {
    baGong: '艮宫五世',
    baGongOrder: 75,
    naJia: [
      '兄弟戌土',
      '子孙申金',
      '父母午火',
      '兄弟丑土',
      '官鬼卯木',
      '父母巳火'
    ],
    shiYing: {
      '2': '应',
      '5': '世'
    }
  },
  {
    baGong: '坤宫三世',
    baGongOrder: 83,
    chongHe: '六合',
    naJia: [
      '子孙酉金',
      '妻财亥水',
      '兄弟丑土',
      '兄弟辰土',
      '官鬼寅木',
      '妻财子水'
    ],
    shiYing: {
      '3': '世',
      '6': '应'
    }
  },
  {
    baGong: '乾宫三世',
    baGongOrder: 13,
    chongHe: '六合',
    naJia: [
      '父母戌土',
      '兄弟申金',
      '官鬼午火',
      '妻财卯木',
      '官鬼巳火',
      '父母未土'
    ],
    shiYing: {
      '3': '世',
      '6': '应'
    }
  },
  {
    baGong: '离宫归魂',
    baGongOrder: 37,
    naJia: [
      '子孙戌土',
      '妻财申金',
      '兄弟午火',
      '官鬼亥水',
      '子孙丑土',
      '父母卯木'
    ],
    shiYing: {
      '3': '世',
      '6': '应'
    }
  },
  {
    baGong: '乾宫归魂',
    baGongOrder: 17,
    naJia: [
      '官鬼巳火',
      '父母未土',
      '兄弟酉金',
      '父母辰土',
      '妻财寅木',
      '子孙子水'
    ],
    shiYing: {
      '3': '世',
      '6': '应'
    }
  },
  {
    baGong: '兑宫五世',
    baGongOrder: 25,
    naJia: [
      '兄弟酉金',
      '子孙亥水',
      '父母丑土',
      '兄弟申金',
      '官鬼午火',
      '父母辰土'
    ],
    shiYing: {
      '2': '应',
      '5': '世'
    }
  },
  {
    baGong: '震宫一世',
    baGongOrder: 41,
    chongHe: '六合',
    naJia: [
      '妻财戌土',
      '官鬼申金',
      '子孙午火',
      '兄弟卯木',
      '子孙巳火',
      '妻财未土'
    ],
    shiYing: {
      '1': '世',
      '4': '应'
    }
  },
  {
    baGong: '震宫归魂',
    baGongOrder: 47,
    naJia: [
      '妻财未土',
      '官鬼酉金',
      '父母亥水',
      '妻财辰土',
      '兄弟寅木',
      '父母子水'
    ],
    shiYing: {
      '3': '世',
      '6': '应'
    }
  },
  {
    baGong: '巽宫归魂',
    baGongOrder: 57,
    naJia: [
      '兄弟寅木',
      '父母子水',
      '妻财戌土',
      '官鬼酉金',
      '父母亥水',
      '妻财丑土'
    ],
    shiYing: {
      '3': '世',
      '6': '应'
    }
  },
  {
    baGong: '坤宫二世',
    baGongOrder: 82,
    naJia: [
      '子孙酉金',
      '妻财亥水',
      '兄弟丑土',
      '兄弟丑土',
      '官鬼卯木',
      '父母巳火'
    ],
    shiYing: {
      '2': '世',
      '5': '应'
    }
  },
  {
    baGong: '乾宫四世',
    baGongOrder: 14,
    naJia: [
      '妻财卯木',
      '官鬼巳火',
      '父母未土',
      '妻财卯木',
      '官鬼巳火',
      '父母未土'
    ],
    shiYing: {
      '1': '应',
      '4': '世'
    }
  },
  {
    baGong: '巽宫五世',
    baGongOrder: 55,
    naJia: [
      '子孙巳火',
      '妻财未土',
      '官鬼酉金',
      '妻财辰土',
      '兄弟寅木',
      '父母子水'
    ],
    shiYing: {
      '2': '应',
      '5': '世'
    }
  },
  {
    baGong: '艮宫一世',
    baGongOrder: 71,
    chongHe: '六合',
    naJia: [
      '官鬼寅木',
      '妻财子水',
      '兄弟戌土',
      '妻财亥水',
      '兄弟丑土',
      '官鬼卯木'
    ],
    shiYing: {
      '1': '世',
      '4': '应'
    }
  },
  {
    baGong: '乾宫五世',
    baGongOrder: 15,
    naJia: [
      '妻财寅木',
      '子孙子水',
      '父母戌土',
      '妻财卯木',
      '官鬼巳火',
      '父母未土'
    ],
    shiYing: {
      '2': '应',
      '5': '世'
    }
  },
  {
    baGong: '坤宫一世',
    baGongOrder: 81,
    chongHe: '六合',
    naJia: [
      '子孙酉金',
      '妻财亥水',
      '兄弟丑土',
      '兄弟辰土',
      '官鬼寅木',
      '妻财子水'
    ],
    shiYing: {
      '1': '世',
      '4': '应'
    }
  },
  {
    baGong: '巽宫四世',
    baGongOrder: 54,
    chongHe: '六冲',
    naJia: [
      '妻财戌土',
      '官鬼申金',
      '子孙午火',
      '妻财辰土',
      '兄弟寅木',
      '父母子水'
    ],
    shiYing: {
      '1': '应',
      '4': '世'
    }
  },
  {
    baGong: '艮宫二世',
    baGongOrder: 72,
    naJia: [
      '官鬼寅木',
      '妻财子水',
      '兄弟戌土',
      '兄弟辰土',
      '官鬼寅木',
      '妻财子水'
    ],
    shiYing: {
      '2': '世',
      '5': '应'
    }
  },
  {
    baGong: '巽宫游魂',
    baGongOrder: 56,
    naJia: [
      '兄弟寅木',
      '父母子水',
      '妻财戌土',
      '妻财辰土',
      '兄弟寅木',
      '父母子水'
    ],
    shiYing: {
      '1': '应',
      '4': '世'
    }
  },
  {
    baGong: '震宫游魂',
    baGongOrder: 46,
    naJia: [
      '妻财未土',
      '官鬼酉金',
      '父母亥水',
      '官鬼酉金',
      '父母亥水',
      '妻财丑土'
    ],
    shiYing: {
      '1': '应',
      '4': '世'
    }
  },
  {
    baGong: '坎宫属水',
    baGongOrder: 60,
    chongHe: '六冲',
    naJia: [
      '兄弟子水',
      '官鬼戌土',
      '父母申金',
      '妻财午火',
      '官鬼辰土',
      '子孙寅木'
    ],
    shiYing: {
      '3': '应',
      '6': '世'
    }
  },
  {
    baGong: '离宫属火',
    baGongOrder: 30,
    chongHe: '六冲',
    naJia: [
      '兄弟巳火',
      '子孙未土',
      '妻财酉金',
      '官鬼亥水',
      '子孙丑土',
      '父母卯木'
    ],
    shiYing: {
      '3': '应',
      '6': '世'
    }
  },
  {
    baGong: '兑宫三世',
    baGongOrder: 23,
    naJia: [
      '父母未土',
      '兄弟酉金',
      '子孙亥水',
      '兄弟申金',
      '官鬼午火',
      '父母辰土'
    ],
    shiYing: {
      '3': '世',
      '6': '应'
    }
  },
  {
    baGong: '震宫三世',
    baGongOrder: 43,
    naJia: [
      '妻财戌土',
      '官鬼申金',
      '子孙午火',
      '官鬼酉金',
      '父母亥水',
      '妻财丑土'
    ],
    shiYing: {
      '3': '世',
      '6': '应'
    }
  },
  {
    baGong: '乾宫二世',
    baGongOrder: 12,
    naJia: [
      '父母戌土',
      '兄弟申金',
      '官鬼午火',
      '兄弟申金',
      '官鬼午火',
      '父母辰土'
    ],
    shiYing: {
      '2': '世',
      '5': '应'
    }
  },
  {
    baGong: '坤宫四世',
    baGongOrder: 84,
    chongHe: '六冲',
    naJia: [
      '兄弟戌土',
      '子孙申金',
      '父母午火',
      '兄弟辰土',
      '官鬼寅木',
      '妻财子水'
    ],
    shiYing: {
      '1': '应',
      '4': '世'
    }
  },
  {
    baGong: '乾宫游魂',
    baGongOrder: 16,
    naJia: [
      '官鬼巳火',
      '父母未土',
      '兄弟酉金',
      '子孙卯木',
      '官鬼巳火',
      '父母未土'
    ],
    shiYing: {
      '1': '应',
      '4': '世'
    }
  },
  {
    baGong: '坎宫游魂',
    baGongOrder: 66,
    naJia: [
      '父母酉金',
      '兄弟亥水',
      '官鬼丑土',
      '兄弟亥水',
      '官鬼丑土',
      '子孙卯木'
    ],
    shiYing: {
      '1': '应',
      '4': '世'
    }
  },
  {
    baGong: '巽宫二世',
    baGongOrder: 52,
    naJia: [
      '兄弟卯木',
      '子孙巳火',
      '妻财未土',
      '父母亥水',
      '妻财丑土',
      '兄弟卯木'
    ],
    shiYing: {
      '2': '世',
      '5': '应'
    }
  },
  {
    baGong: '艮宫四世',
    baGongOrder: 74,
    naJia: [
      '父母巳火',
      '兄弟未土',
      '子孙酉金',
      '兄弟丑土',
      '官鬼卯木',
      '父母巳火'
    ],
    shiYing: {
      '1': '应',
      '4': '世'
    }
  },
  {
    baGong: '兑宫四世',
    baGongOrder: 24,
    naJia: [
      '子孙子水',
      '父母戌土',
      '兄弟申金',
      '兄弟申金',
      '官鬼午火',
      '父母辰土'
    ],
    shiYing: {
      '1': '应',
      '4': '世'
    }
  },
  {
    baGong: '震宫二世',
    baGongOrder: 42,
    naJia: [
      '妻财戌土',
      '官鬼申金',
      '子孙午火',
      '子孙午火',
      '妻财辰土',
      '兄弟寅木'
    ],
    shiYing: {
      '2': '世',
      '5': '应'
    }
  },
  {
    baGong: '艮宫三世',
    baGongOrder: 73,
    naJia: [
      '官鬼寅木',
      '妻财子水',
      '兄弟戌土',
      '兄弟丑土',
      '官鬼卯木',
      '父母巳火'
    ],
    shiYing: {
      '3': '世',
      '6': '应'
    }
  },
  {
    baGong: '巽宫三世',
    baGongOrder: 53,
    naJia: [
      '兄弟卯木',
      '子孙巳火',
      '妻财未土',
      '妻财辰土',
      '兄弟寅木',
      '父母子水'
    ],
    shiYing: {
      '3': '世',
      '6': '应'
    }
  },
  {
    baGong: '坤宫五世',
    baGongOrder: 85,
    naJia: [
      '兄弟未土',
      '子孙酉金',
      '妻财亥水',
      '兄弟辰土',
      '官鬼寅木',
      '妻财子水'
    ],
    shiYing: {
      '2': '应',
      '5': '世'
    }
  },
  {
    baGong: '乾宫一世',
    baGongOrder: 11,
    naJia: [
      '父母戌土',
      '兄弟申金',
      '官鬼午火',
      '兄弟酉土',
      '子孙亥水',
      '父母丑土'
    ],
    shiYing: {
      '1': '世',
      '4': '应'
    }
  },
  {
    baGong: '兑宫二世',
    baGongOrder: 22,
    naJia: [
      '父母未土',
      '兄弟酉金',
      '子孙亥水',
      '妻财卯木',
      '官鬼巳火',
      '父母未土'
    ],
    shiYing: {
      '2': '世',
      '5': '应'
    }
  },
  {
    baGong: '震宫四世',
    baGongOrder: 44,
    naJia: [
      '官鬼酉金',
      '父母亥水',
      '妻财丑土',
      '官鬼酉金',
      '父母亥水',
      '妻财丑土'
    ],
    shiYing: {
      '1': '应',
      '4': '世'
    }
  },
  {
    baGong: '兑宫一世',
    baGongOrder: 21,
    chongHe: '六合',
    naJia: [
      '父母未土',
      '兄弟酉金',
      '子孙亥水',
      '官鬼午火',
      '父母辰土',
      '妻财寅木'
    ],
    shiYing: {
      '1': '世',
      '4': '应'
    }
  },
  {
    baGong: '震宫五世',
    baGongOrder: 45,
    naJia: [
      '父母子水',
      '妻财戌土',
      '官鬼申金',
      '官鬼酉金',
      '父母亥水',
      '妻财丑土'
    ],
    shiYing: {
      '2': '应',
      '5': '世'
    }
  },
  {
    baGong: '坎宫四世',
    baGongOrder: 64,
    naJia: [
      '官鬼未土',
      '父母酉金',
      '兄弟亥水',
      '兄弟亥水',
      '官鬼丑土',
      '子孙卯木'
    ],
    shiYing: {
      '1': '应',
      '4': '世'
    }
  },
  {
    baGong: '离宫二世',
    baGongOrder: 32,
    naJia: [
      '兄弟巳火',
      '子孙未土',
      '妻财酉金',
      '妻财酉金',
      '官鬼亥水',
      '子孙丑土'
    ],
    shiYing: {
      '2': '世',
      '5': '应'
    }
  },
  {
    baGong: '震宫属木',
    baGongOrder: 40,
    chongHe: '六冲',
    naJia: [
      '妻财戌土',
      '官鬼申金',
      '子孙午火',
      '妻财辰土',
      '兄弟寅木',
      '父母子水'
    ],
    shiYing: {
      '3': '应',
      '6': '世'
    }
  },
  {
    baGong: '艮宫属土',
    baGongOrder: 70,
    chongHe: '六冲',
    naJia: [
      '官鬼寅木',
      '妻财子水',
      '兄弟戌土',
      '子孙申金',
      '父母午火',
      '兄弟辰土'
    ],
    shiYing: {
      '3': '应',
      '6': '世'
    }
  },
  {
    baGong: '艮宫归魂',
    baGongOrder: 77,
    naJia: [
      '官鬼卯木',
      '父母巳火',
      '兄弟未土',
      '子孙申金',
      '父母午火',
      '兄弟辰土'
    ],
    shiYing: {
      '3': '世',
      '6': '应'
    }
  },
  {
    baGong: '兑宫归魂',
    baGongOrder: 27,
    naJia: [
      '父母戌土',
      '兄弟申金',
      '官鬼午火',
      '父母丑土',
      '妻财卯木',
      '官鬼巳火'
    ],
    shiYing: {
      '3': '世',
      '6': '应'
    }
  },
  {
    baGong: '坎宫五世',
    baGongOrder: 65,
    naJia: [
      '官鬼戌土',
      '父母申金',
      '妻财午火',
      '兄弟亥水',
      '官鬼丑土',
      '子孙卯木'
    ],
    shiYing: {
      '2': '应',
      '5': '世'
    }
  },
  {
    baGong: '离宫一世',
    baGongOrder: 31,
    chongHe: '六合',
    naJia: [
      '兄弟巳火',
      '子孙未土',
      '妻财酉金',
      '妻财申金',
      '兄弟午火',
      '子孙辰土'
    ],
    shiYing: {
      '1': '世',
      '4': '应'
    }
  },
  {
    baGong: '巽宫属木',
    baGongOrder: 50,
    chongHe: '六冲',
    naJia: [
      '兄弟卯木',
      '子孙巳火',
      '妻财未土',
      '官鬼酉金',
      '父母亥水',
      '妻财丑土'
    ],
    shiYing: {
      '3': '应',
      '6': '世'
    }
  },
  {
    baGong: '兑宫属金',
    baGongOrder: 20,
    chongHe: '六冲',
    naJia: [
      '父母未土',
      '兄弟酉金',
      '子孙亥水',
      '父母丑土',
      '妻财卯木',
      '官鬼巳火'
    ],
    shiYing: {
      '3': '应',
      '6': '世'
    }
  },
  {
    baGong: '离宫五世',
    baGongOrder: 35,
    naJia: [
      '父母卯木',
      '兄弟巳火',
      '子孙未土',
      '兄弟午火',
      '子孙辰土',
      '父母寅木'
    ],
    shiYing: {
      '2': '应',
      '5': '世'
    }
  },
  {
    baGong: '坎宫一世',
    baGongOrder: 61,
    chongHe: '六合',
    naJia: [
      '兄弟子水',
      '官鬼戌土',
      '父母申金',
      '官鬼丑土',
      '子孙卯木',
      '妻财巳火'
    ],
    shiYing: {
      '1': '世',
      '4': '应'
    }
  },
  {
    baGong: '艮宫游魂',
    baGongOrder: 76,
    naJia: [
      '官鬼卯木',
      '父母巳火',
      '兄弟未土',
      '兄弟丑土',
      '官鬼卯木',
      '父母巳火'
    ],
    shiYing: {
      '1': '应',
      '4': '世'
    }
  },
  {
    baGong: '兑宫游魂',
    baGongOrder: 26,
    naJia: [
      '父母戌土',
      '兄弟申金',
      '官鬼午火',
      '兄弟申金',
      '官鬼午火',
      '父母辰土'
    ],
    shiYing: {
      '1': '应',
      '4': '世'
    }
  },
  {
    baGong: '坎宫三世',
    baGongOrder: 63,
    naJia: [
      '兄弟子水',
      '官鬼戌土',
      '父母申金',
      '兄弟亥水',
      '官鬼丑土',
      '子孙卯木'
    ],
    shiYing: {
      '3': '世',
      '6': '应'
    }
  },
  {
    baGong: '离宫三世',
    baGongOrder: 33,
    naJia: [
      '兄弟巳火',
      '子孙未土',
      '妻财酉金',
      '兄弟午火',
      '子孙辰土',
      '父母寅木'
    ],
    shiYing: {
      '3': '世',
      '6': '应'
    }
  }
]
