export default {
  甲: {
    六神: ['青龙', '朱雀', '勾陈', '螣蛇', '白虎', '玄武'],
  },
  乙: {
    六神: ['青龙', '朱雀', '勾陈', '螣蛇', '白虎', '玄武'],
  },
  丙: {
    六神: ['朱雀', '勾陈', '螣蛇', '白虎', '玄武', '青龙'],
  },
  丁: {
    六神: ['朱雀', '勾陈', '螣蛇', '白虎', '玄武', '青龙'],
  },
  戊: {
    六神: ['勾陈', '螣蛇', '白虎', '玄武', '青龙', '朱雀'],
  },
  己: {
    六神: ['螣蛇', '白虎', '玄武', '青龙', '朱雀', '勾陈'],
  },
  庚: {
    六神: ['白虎', '玄武', '青龙', '朱雀', '勾陈', '螣蛇'],
  },
  辛: {
    六神: ['白虎', '玄武', '青龙', '朱雀', '勾陈', '螣蛇'],
  },
  壬: {
    六神: ['玄武', '青龙', '朱雀', '勾陈', '螣蛇', '白虎'],
  },
  癸: {
    六神: ['玄武', '青龙', '朱雀', '勾陈', '螣蛇', '白虎'],
  },
}
