// 甲禄在寅，乙禄在卯，丙戊禄在巳，丁己禄在午，庚禄在申，辛禄在酉，壬禄在亥，癸禄在子。
// 甲戊兼牛羊，乙己鼠猴乡，丙丁猪鸡位，壬癸兔蛇藏，庚辛逢虎马，此是贵人方。

export default {
  甲: {
    六神: ['青龙', '朱雀', '勾陈', '螣蛇', '白虎', '玄武'],
    日禄: '寅',
    贵人: '丑未',
  },
  乙: {
    六神: ['青龙', '朱雀', '勾陈', '螣蛇', '白虎', '玄武'],
    日禄: '卯',
    贵人: '子申',
  },
  丙: {
    六神: ['朱雀', '勾陈', '螣蛇', '白虎', '玄武', '青龙'],
    日禄: '巳',
    贵人: '亥酉',
  },
  丁: {
    六神: ['朱雀', '勾陈', '螣蛇', '白虎', '玄武', '青龙'],
    日禄: '午',
    贵人: '亥酉',
  },
  戊: {
    六神: ['勾陈', '螣蛇', '白虎', '玄武', '青龙', '朱雀'],
    日禄: '巳',
    贵人: '丑未',
  },
  己: {
    六神: ['螣蛇', '白虎', '玄武', '青龙', '朱雀', '勾陈'],
    日禄: '午',
    贵人: '子申',
  },
  庚: {
    六神: ['白虎', '玄武', '青龙', '朱雀', '勾陈', '螣蛇'],
    日禄: '申',
    贵人: '寅午',
  },
  辛: {
    六神: ['白虎', '玄武', '青龙', '朱雀', '勾陈', '螣蛇'],
    日禄: '酉',
    贵人: '寅午',
  },
  壬: {
    六神: ['玄武', '青龙', '朱雀', '勾陈', '螣蛇', '白虎'],
    日禄: '亥',
    贵人: '卯巳',
  },
  癸: {
    六神: ['玄武', '青龙', '朱雀', '勾陈', '螣蛇', '白虎'],
    日禄: '子',
    贵人: '卯巳',
  },
}
