export default [
  [
    {
      key: '方位',
      value: '西北'
    },
    {
      key: '场所',
      value:
        '圣地 宫殿 博物馆 教堂 寺院 体育馆 大学 办公室 五金店 机关政府 车站 广场 郊外 古迹'
    },
    {
      key: '静物',
      value: '玉器 珠宝 古董 文物 神物 帽子 钟表 首饰 木果 瓜 腊肉 飞机 火车 门'
    },
    {
      key: '动物',
      value: '马 龙 狮 虎 象 天鹅'
    }
  ],
  [
    {
      key: '方位',
      value: '西'
    },
    {
      key: '场所',
      value:
        '沼泽地 水井 湖泊 冰场 破旧房屋 门口 山洞 信访办 公园 音乐厅 歌舞厅 饭店'
    },
    {
      key: '静物',
      value:
        '刀剑玩具 开口瓶罐 破损物 修理品 垃圾箱 乐器 玻璃 食品 饮食用具 裂口坚果'
    },
    {
      key: '动物',
      value: '羊 豹 猴 兔'
    }
  ],
  [
    {
      key: '方位',
      value: '南'
    },
    {
      key: '场所',
      value:
        '圣地 教堂 学校 博物馆 图书馆 印刷厂 艺术馆 画展 电视台 电影院 证券交易所 银行 医院 厨房 电厂 冶炼厂 立交桥 派出所 法院'
    },
    {
      key: '静物',
      value:
        '化妆品 花瓶 花衣服 相机 电视 电话 字画 连环画 广告 奖状 合同 印章 信件 书报 杂志\n          火柴 打火机 煤气灶 火炉 烤箱 灯具 红路灯 霓虹灯 窗户 玻璃 干肉 微波炉 电车 兵戈'
    },
    {
      key: '动物',
      value: '雉 孔雀 凤凰 金鱼 虾 蟹 龟 萤火虫'
    }
  ],
  [
    {
      key: '方位',
      value: '东'
    },
    {
      key: '场所',
      value:
        '山林 花店 音乐厅 游乐场 公园 庭院 田园 菜地 菜场 邮电局 剧院 机场 车站 停车场 军队 军营 公安局'
    },
    {
      key: '静物',
      value:
        '树木 柴火 竹子 筐 鲜花 蔬菜 嫩芽 鞭炮 音响 鼓 电话 闹钟 火箭 大炮 汽车 大道 裙子 裤子 筋 蹄'
    },
    {
      key: '动物',
      value: '龙 蛇 鹰 鸟 蜂 蜈蚣'
    }
  ],
  [
    {
      key: '方位',
      value: '东南'
    },
    {
      key: '场所',
      value:
        '通风口 管道 长廊 索道 传送带 码头 港口 机场 商店 工厂 设计院 竹林 草原 邮局 寺庙'
    },
    {
      key: '静物',
      value:
        '风车 扇子 气球 羽毛 飞机 旗杆 帆船 救生圈 草药 木材 建材 床 桌子 绳子 管道 皮带 标枪 杨柳 索道 传送带 海带 邮件 账本 录像'
    },
    {
      key: '动物',
      value: '鸡 鸭 鹅 蝴蝶 蜻蜓 带鱼 猫 虎 斑马'
    }
  ],
  [
    {
      key: '方位',
      value: '北'
    },
    {
      key: '场所',
      value:
        '湖海 大川 河流 瀑布 温泉 洼地 冷饮店 酒吧 浴池 妓院 牢狱 消防队 鱼塘 水厂 海洋馆 酒厂 酒窖 车库 暗室 煤场 车站'
    },
    {
      key: '静物',
      value:
        '潜水艇 饮料 油盐 酒 酱 醋 汤 海味 带核之物 梅子 桃子 冷藏设备 冷饮 排水设备 潜艇 水车 轮子 弓箭 刑具 药品 计算器 录像带 光盘'
    },
    {
      key: '动物',
      value: '猪 鼠 鱼'
    }
  ],
  [
    {
      key: '方位',
      value: '东北'
    },
    {
      key: '场所',
      value:
        '矿山 丘陵 堤坝 小路 坟场 高地 高楼 房屋 祠堂 围墙 帐篷 休息室 仓库 车站 派出所 宗庙 祠堂 银行'
    },
    {
      key: '静物',
      value:
        '岩石 土坑 假山 山坡 墙壁 土堆 石碑 坟墓 矿山 山路 公墓 监狱 仓库 停车场 门 门闩 门槛 台阶 凳子 床 桌子 座位 柜子 手套 列车'
    },
    {
      key: '动物',
      value: '狗 熊 狼'
    }
  ],
  [
    {
      key: '方位',
      value: '西南'
    },
    {
      key: '场所',
      value:
        '平原 牧场 农贸市场 粮仓 储藏室 地窖 场院 郊外 故乡 农村 田埂 田野 广场 平房 售楼部'
    },
    {
      key: '静物',
      value:
        '方物 柔物 纸张 文章 书 纸箱 布帛 丝绵 衣服 箱包 袋子 五谷 米面 日用品 瓦器 瓷器 石灰 水泥 砖沙 粉状物 糖 野味 火车'
    },
    {
      key: '动物',
      value: '牛 母马 猫 爬虫'
    }
  ]
]
