export default [
  [
    {
      key: '类象',
      value: '阳 天 圆 金 寒 尊 贵 精 古 正 高大上 富 变 傲 首 头'
    }
  ],
  [
    {
      key: '类象',
      value: '泽 云 雾 露 口舌 巫 决策 悦 笑 和 惠 柔 艳 缺 毁 穴 金 刚卤 妾 朋'
    }
  ],
  [
    {
      key: '类象',
      value:
        '火 热情 盛大 光明 干燥 电 日 丽 美丽 文 文明 文书 合同 房产 账目 票据 饰 装饰 饰品 目 中虚 大腹 甲胄 网 内柔 旋涡'
    }
  ],
  [
    {
      key: '类象',
      value:
        '雷 动 疾 进 新 惧 闹 鼓 躁 大 扁木 竹 筐 藩 乐器 舟 足 飞 走 逐 盂 大笑 妻'
    }
  ],
  [
    {
      key: '类象',
      value:
        '风 进退 出入 轻 抚 疾 迷 虚幻 齐 顺 命 伏 婢女 长 高 草木 林 绳 腰带 丝 羽毛 利 富 商旅 号啕 股'
    }
  ],
  [
    {
      key: '类象',
      value:
        '水 雨 雪 霜 月 血 酒 污 浊 厕 淫 恶 暗 险 陷 律法 刑法 寇盗 败 核 耳 肾 腰 曲 弓 曳 轮 心 思想 忧虑 困'
    }
  ],
  [
    {
      key: '类象',
      value:
        '山 鼓 凸 孤 石 土 冥 门阙 城 墙 巷 瓦器 伞 止 阻 退 星 童仆 闲人 足 趾 鼻 腓 皮肤'
    }
  ],
  [
    {
      key: '类象',
      value:
        '地 厚 承载 滋养 包 藏 静 缓 迟钝 丑 贞节 操劳 卑 众 多 配 柔 方 帛 布 裳 土 田 邑 宫阙 城 壁 阴 寡妇 奴婢 肉 迷 囊 '
    }
  ]
]
