export default [
  [
    {
      key: '人物',
      value: '老人',
      ext: '超过64岁'
    },
    {
      key: '身体',
      value: '头 胸部 大肠 肺 左足'
    },
    {
      key: '疾病',
      value: '头部之疾 肺疾 肠疾 筋骨疾 腿疾'
    },
    {
      key: '性格',
      value: '积极向上 正直 威严 自尊 冷酷无情 轻视 任性 独裁'
    },
    {
      key: '职业',
      value: '统治者 总经理 厂长 专家 名人 圣人 官吏 富人 银行家'
    }
  ],
  [
    {
      key: '人物',
      value: '少女',
      ext: '0-14岁'
    },
    {
      key: '身体',
      value: '舌 口 咽喉 牙齿 口角 气管 肛门'
    },
    {
      key: '疾病',
      value: '口舌牙之疾 咽喉气管疾病 外伤 贫血 破相'
    },
    {
      key: '性格',
      value: '温和 欢快 撒娇 可爱 好强 雄辩 伪善 狭小'
    },
    {
      key: '职业',
      value:
        '讲师 解说员 相声演员 歌唱家 音乐家 杂技演员 小丑 歌女 娼妓 情人 媒人 秘书 副手 服务员 垃圾工 失败者 破坏者 牙医'
    }
  ],
  [
    {
      key: '人物',
      value: '美女',
      ext: '14-28岁'
    },
    {
      key: '身体',
      value: '目 眼睛 心脏 血液 乳房 小肠'
    },
    {
      key: '疾病',
      value: '眼疾 心脏病 烫伤 发烧 炎症 高血压 乳腺疾病'
    },
    {
      key: '性格',
      value: '自信 聪明 文明 礼貌 虚荣 轻浮 撒谎 依附'
    },
    {
      key: '职业',
      value:
        '艺术家 画家 演员 明星 化妆师 记者 文人 学者 博士 中层干部 监察人员 纪检人员 侦查员 分析员 警卫 战士'
    }
  ],
  [
    {
      key: '人物',
      value: '中年',
      ext: '40-64岁'
    },
    {
      key: '身体',
      value: '足 腿部 肝脏 神经 左肋 右肩膀'
    },
    {
      key: '疾病',
      value: '足疾 肝病 精神病 狂躁病 多动症 咳嗽'
    },
    {
      key: '性格',
      value: '积极 活泼 主动 勇敢 霸道 急躁 无礼 粗糙'
    },
    {
      key: '职业',
      value:
        '运动员 驾驶员 邮递员 快递员 大忙人 捣蛋鬼 多动症 名人 军人 大将 指挥官 音乐家 舞蹈演员 足球爱好者 吹牛之人'
    }
  ],
  [
    {
      key: '人物',
      value: '夫人',
      ext: '28-49岁'
    },
    {
      key: '身体',
      value: '股 头发 气管 肠道 血管 腰腿 左肩'
    },
    {
      key: '疾病',
      value: '伤风感冒 支气管炎 中风 抽筋 血管疾病 淋巴疾病 妇科病'
    },
    {
      key: '性格',
      value: '风流 轻佻 忧虑 烦躁 直爽 魄力 细心 谋略'
    },
    {
      key: '职业',
      value: '商人 教师 指挥官 设计师 作家 造谣者 技术员 营业员 僧尼 宗教家'
    }
  ],
  [
    {
      key: '人物',
      value: '青年',
      ext: '16-40岁'
    },
    {
      key: '身体',
      value: '耳 背 腰 肾脏 膀胱 泌尿系统 免疫系统'
    },
    {
      key: '疾病',
      value: '耳痛 腰背疾病 泌尿系统疾病 肾寒 尿毒症 性病'
    },
    {
      key: '性格',
      value: '聪明 智慧 仁慈 义气 狡猾 奸诈 阴险 算计'
    },
    {
      key: '职业',
      value:
        '水厂工人 船工 酒鬼 诈骗 盗贼 黑社会 亡命之徒 安全人员 劳务人员 思想家 发明家 数学家'
    }
  ],
  [
    {
      key: '人物',
      value: '中年',
      ext: '40-64岁'
    },
    {
      key: '身体',
      value: '手 鼻 脾胃 关节 右足 乳房'
    },
    {
      key: '疾病',
      value: '鼻炎 气血不通症 便秘 结石 消化不良 癌症'
    },
    {
      key: '性格',
      value: '冷静 独立 自律 憨厚 顽固 保守 孤僻 隐藏'
    },
    {
      key: '职业',
      value:
        '矿工 土建 警卫 守门员 法官 独裁者 官僚 继承人 闲人 粉丝 奴仆 犯人 僧尼'
    }
  ],
  [
    {
      key: '人物',
      value: '老妇',
      ext: '超过49'
    },
    {
      key: '身体',
      value: '腹 胃 肉 女性生殖器'
    },
    {
      key: '疾病',
      value: '肚子痛 劳累过度 慢性病 皮肤病 妇科病 湿疹'
    },
    {
      key: '性格',
      value: '勤劳 忍耐 正直 谦让 实诚 懦弱 迟钝 狭隘 阴险'
    },
    {
      key: '职业',
      value: '农民 泥瓦匠 村干部 助手 顾问 地产商 税务人员'
    }
  ]
]
