// 增删卜易
export default [
  {
    占问: '001占父近病',
    占类: '疾病',
    卦主: '父母',
    卦象: '777977',
    月建: '辰',
    日辰: '戊申',
    旬空: '寅卯',
    用神: '父母辰土',
    吉凶: `
    1.近病逢六冲即愈，吉
    2.用神辰土临月建，吉
    3.元神午火生辰土，与变爻未土合绊，吉中带凶
    4.忌神寅木暗动克辰土，与元神同动，吉
    `,
    应期: '元神合绊，冲去变爻之日',
    细节: '丑日冲去未土，寅木生午火，午火生辰土',
    启示: '贪合忘生，贪生忘克',
  },
  {
    占问: '002占谒贵求财',
    占类: '财运',
    卦主: '妻财',
    卦象: '978798',
    月建: '酉',
    日辰: '辛亥',
    旬空: '寅卯',
    用神: '妻财寅木',
    吉凶: `
    1.用神妻财寅木，月破，日冲，旬空，凶
    2.忌神兄弟酉金，化退神申金，平
    3.巳火动而化寅木，回头生，财生动爻，动爻生世，吉
    `,
    应期: '元神旬空，出空之日；忌神旺相，冲去忌神之日',
    细节: '寅日出空，用神回头生动爻，动爻生世；寅日冲申金',
    启示: '动必有因，动不为破，化为真破；勾陈为虚，玄武为实',
  },
  {
    占问: '003占自病',
    占类: '疾病',
    卦主: '世爻',
    卦象: '877796',
    月建: '巳',
    日辰: '乙未',
    旬空: '辰巳',
    用神: '父母亥水',
    吉凶: `
    1.用神父母亥水，月破，日克，凶
    2.元神官鬼酉金，化回头生
    3.忌神妻财未土，化回头生
    4.妻财丑土暗动，克用神，凶
    5.忌神生元神，元神生用神，吉
    `,
    应期: '元神旺相，冲去元神之日',
    细节: '卯日冲动元神酉金，用神被忌神所克',
    启示: '月破凶在月内，日月组合永世凶，生而无根',
  },
  {
    占问: '004占兄获罪，能否解救',
    占类: '刑罚',
    卦主: '兄弟',
    卦象: '788688',
    月建: '卯',
    日辰: '己卯',
    旬空: '申酉',
    用神: '兄弟丑土',
    吉凶: `
    1.用神兄弟丑土，月克，日克，凶
    2.变爻父母午火，化回头生，吉
    3.子孙酉金暗动，化回头生，吉
    `,
    应期: '元神衰弱，日建之日',
    细节: '午日日建，元神旺相',
    启示: '月破日克 > 动爻生 > 月克日克',
  },
  {
    占问: '005占父官事，已拟重罪',
    占类: '刑罚',
    卦主: '父母',
    卦象: '686776',
    月建: '卯',
    日辰: '戊辰',
    旬空: '戌亥',
    用神: '父母未土',
    吉凶: `
    1.用神父母未土，月克，日旺，化进神，吉
    2.变爻父母戌土，月克，日冲，刑用神，平
    3.亥卯未三合木局，克用神，凶
    `,
    应期: '',
    细节: '...',
    启示: '月破日刑全无助，动克变冲皆为凶',
  },
  {
    占问: '006占兄官事，亦拟重罪',
    占类: '刑罚',
    卦主: '兄弟',
    卦象: '868777',
    月建: '卯',
    日辰: '戊辰',
    旬空: '戌亥',
    用神: '兄弟申金',
    吉凶: `
    1.用神兄弟申金，日生，吉
    2.忌神官鬼巳火，化回头生
    3.父母戌土暗动，生用神
    4.忌神生暗动，暗动生用神，吉
    `,
    应期: '...',
    细节: '父母临朱雀，表示文书，法令',
    启示: '贪生忘克，先生克后冲合',
  },
  {
    占问: '007占弟痘症',
    占类: '疾病',
    卦主: '兄弟',
    卦象: '787678',
    月建: '辰',
    日辰: '丙申',
    旬空: '辰巳',
    用神: '兄弟亥水',
    吉凶: `
    1.用神兄弟亥水，月克，月墓，日生，平
    2.元神父母申金，日建，吉
    `,
    应期: '用神衰弱，合冲月建；值日建之日',
    细节: '酉时合辰土，免遭月墓；戌日冲辰土，免遭月克；亥日值日辰，吉不可言',
    启示: '三墓：日墓，动墓，化墓；合只能暂时合住不作恶，冲则彻底冲散',
  },
  {
    占问: '008占求财',
    占类: '财运',
    卦主: '妻财',
    卦象: '777787',
    月建: '寅',
    日辰: '庚戌',
    旬空: '寅卯',
    用神: '妻财寅木',
    吉凶: `
    1.用神妻财寅木，月建，旬空，平
    2.用神克世，吉
    `,
    应期: '用神旬空，出空之日',
    细节: '寅日出空',
    启示: '财爻克世者必得；身弱不胜财',
  },
  {
    占问: '009占谒贵',
    占类: '官运',
    卦主: '官鬼',
    卦象: '879887',
    月建: '酉',
    日辰: '丙寅',
    旬空: '戌亥',
    用神: '官鬼酉金',
    吉凶: `
    1.用神官鬼酉金，月建，吉
    2.变爻子孙午火，化回头克，凶
    `,
    应期: '变爻发动克动爻，冲去变爻之日',
    细节: '子日冲去午火',
    启示: '月建 > 回头克',
  },
  {
    占问: '010占官之升迁',
    占类: '官运',
    卦主: '官鬼',
    卦象: '689887',
    月建: '寅',
    日辰: '丙申',
    旬空: '辰巳',
    用神: '官鬼寅木',
    吉凶: `
    1.用神官鬼寅木，月建，日冲，日克，平
    2.忌神子孙申金，化回头生，月囚，日建，凶
    3.申子辰三合水局，生用神，吉
    `,
    应期: '动爻三合旬空，出空之日',
    细节: '辰月出空；世爻暗动，临驿马，有奔波之义；官爻在六爻，有远方之意',
    启示: '三合 > 动爻',
  },
  {
    占问: '011占弟被讼',
    占类: '诉讼',
    卦主: '兄弟',
    卦象: '876798',
    月建: '午',
    日辰: '丁未',
    旬空: '寅卯',
    用神: '兄弟酉金',
    吉凶: `
    1.用神兄弟酉金，月克，日生，平
    2.变爻兄弟申金，化退神，年合，凶
    3.忌神官鬼午火，月建，日生，凶
    `,
    应期: '变爻化退，值年建之年',
    细节: '辰年相合，无妨；申年年建，大祸临头',
    启示: '六合，应迟不应急',
  },
  {
    占问: '012占开铺面',
    占类: '经营',
    卦主: '妻财',
    卦象: '687889',
    月建: '寅',
    日辰: '丁酉',
    旬空: '辰巳',
    用神: '妻财子水',
    吉凶: `
    1.用神妻财子水，月休，日生，平
    2.忌神兄弟辰土，化回头克，凶中带吉
    3.世爻官鬼寅木，月建，日克，化回头克，凶
    `,
    应期: '世爻衰弱，入墓之日，冲动之日',
    细节: '木墓于未，官鬼持世疾病缠身；申金冲克世爻，财被盗尽；',
    启示: '世爻 > 用神',
  },
  {
    占问: '013占妹临产',
    占类: '生育',
    卦主: '兄弟',
    卦象: '888787',
    月建: '午',
    日辰: '戊辰',
    旬空: '戌亥',
    用神: '兄弟酉金',
    吉凶: `
    1.用神兄弟酉金，月克，日生，日合，吉
    `,
    应期: '用神合绊，冲出之日',
    细节: '卯酉相冲，卯日卯时生产',
    启示: '合 > 生；静而逢合谓之合起，动而逢合谓之合绊；若逢合住，必待冲开',
  },
  {
    占问: '014占子痘症',
    占类: '疾病',
    卦主: '子孙',
    卦象: '778977',
    月建: '未',
    日辰: '甲午',
    旬空: '辰巳',
    用神: '子孙申金',
    吉凶: `
    1.用神子孙申金，月克，日生，平
    2.忌神父母午火，化拌，凶
    `,
    应期: '化绊，冲出之日',
    细节: '丑未相冲，丑日冲去为土，火来伤金，危矣',
    启示: '化拌',
  },
  {
    占问: '015占病',
    占类: '疾病',
    卦主: '世爻',
    卦象: '867777',
    月建: '申',
    日辰: '戊午',
    旬空: '子丑',
    用神: '官鬼午火',
    吉凶: `
    1.用神官鬼午火，月囚，日建，吉
    2.忌神子孙亥水，月生，凶
    `,
    应期: '忌神动，动爻值月建之月',
    细节: '亥月，忌神月建',
    启示: '官鬼持世，子孙动克鬼，吉；子孙动生世，吉',
  },
  {
    占问: '016占仆何日回',
    占类: '出行',
    卦主: '妻财',
    卦象: '779776',
    月建: '巳',
    日辰: '丁亥',
    旬空: '午未',
    用神: '妻财亥水',
    吉凶: `
    1.用神妻财亥水，月破，日建，平
    2.忌神兄弟未土，化进神，凶
    3.忌神兄弟辰土，化退神，凶
    `,
    应期: '忌神动，动爻合起之月；化进神，变爻合起之日',
    细节: '午未相合，午月忌神旺；卯戌相合，卯日进神旺',
    启示: '玄武持世，有所隐瞒；世生用，有所求；临白虎，祸事上身',
  },
  {
    占问: '017占生产',
    占类: '生产',
    卦主: '世爻',
    卦象: '888867',
    月建: '',
    日辰: '戊子',
    旬空: '午未',
    用神: '子孙子水',
    吉凶: `
    1.用神子孙子水，月--，日建，吉
    2.变爻官鬼巳火，化鬼，化绝，凶
    `,
    应期: '',
    细节: '...',
    启示: '子孙与鬼互化，均为夭折',
  },
  {
    占问: '018占兄病',
    占类: '疾病',
    卦主: '兄弟',
    卦象: '788698',
    月建: '申',
    日辰: '甲辰',
    旬空: '寅卯',
    用神: '兄弟子水',
    吉凶: `
    1.用神兄弟子水，月生，日克，日墓，平
    2.元神父母申金，月建，日生，化回头克
    3.忌神官鬼戌土，月休，日扶
    4.忌神生元神，元神生用神，吉
    5.子孙寅木持世，旬空，吉
    `,
    应期: '元神动，动爻日建之日；喜神旬空，冲空之日',
    细节: '申日，元神日建，世爻冲空',
    启示: '月建日生 > 回头克；月破日克 > 回头生；入墓，处于昏睡状态',
  },
  {
    占问: '019占会试',
    占类: '考试',
    卦主: '父母',
    卦象: '888677',
    月建: '辰',
    日辰: '己巳',
    旬空: '戌亥',
    用神: '父母未土',
    吉凶: `
    1.用神父母未土，月扶，日生，吉
    2.变爻官鬼午火，回头生，化绊，凶
    `,
    应期: '元神动，动爻日建之日；喜神旬空，冲空之日',
    细节: '化绊，冲动变爻之日',
    启示: '日绊，动绊，化绊',
  },
  {
    占问: '020占官事罪',
    占类: '刑罚',
    卦主: '世爻',
    卦象: '879877',
    月建: '未',
    日辰: '戊辰',
    旬空: '戌亥',
    用神: '兄弟卯木',
    吉凶: `
    1.用神兄弟卯木，月囚，月墓，凶
    2.忌神官鬼酉金，月扶，日合，化子孙午火回头克，凶中带吉
    3.忌神鬼爻持世，临白虎，凶
    `,
    应期: '忌神动，值月建之月；变爻克忌神，冲动变爻之日',
    细节: '酉月，忌神月建；子月，冲动变爻',
    启示: '月扶日 > 回头克',
  },
  {
    占问: '021占岁考',
    占类: '考试',
    卦主: '父母',
    卦象: '878678',
    月建: '丑',
    日辰: '戊申',
    旬空: '寅卯',
    用神: '父母申金',
    吉凶: `
    1.用神父母申金，月生，月墓，日建，生世，吉
    2.子孙寅木暗动冲用神，凶
    3.世爻兄弟子水，月克，月合，日生，吉
    4.六冲变六合，吉
    `,
    应期: '',
    细节: '...',
    启示: '合 > 生克 > 冲',
  },
  {
    占问: '022占讼事',
    占类: '诉讼',
    卦主: '官鬼',
    卦象: '777888',
    月建: '戌',
    日辰: '丁卯',
    旬空: '戌亥',
    用神: '官鬼寅木',
    吉凶: `
    1.用神官鬼寅木，月囚，日扶，克世，吉
    2.忌神子孙酉金，暗动克用神，凶
    3.世爻兄弟辰土，月破，日克，凶
    `,
    应期: '用神克世，值用神日建之日',
    细节: '被杖者，寅木克世也',
    启示: '用神克世局，财爻克世，得财；子孙克世，化鬼，去疾去忧；行人克世，速归',
  },
  {
    占问: '023占出行',
    占类: '出行',
    卦主: '世爻',
    卦象: '987688',
    月建: '申',
    日辰: '丙子',
    旬空: '申酉',
    用神: '官鬼丑土',
    吉凶: `
    1.用神官鬼丑土，月休，日绊，凶
    2.动爻子孙卯木，月克，月绝，日生，化鬼，平
    `,
    应期: '子动化鬼，鬼爻值日建之日',
    细节: '合住，必有羁绊；子动化鬼，儿女少安；女死辰日，化鬼日建',
    启示: '出行为合绊，其余为合起',
  },
  {
    占问: '024占已悔婚，将来成否？',
    占类: '婚姻',
    卦主: '妻财',
    卦象: '987787',
    月建: '未',
    日辰: '丁巳',
    旬空: '子丑',
    用神: '妻财酉金',
    吉凶: `
    1.用神妻财酉金，月生，日克，平
    2.忌神父母卯木，月囚，冲用神，凶中带吉
    3.外卦伏吟，凶
    4.六冲变六合，吉
    `,
    应期: '用神被冲，值月合之月',
    细节: '辰月，月合，冲之不动',
    启示: '内卦伏吟内呻吟，外卦伏吟外不宁',
  },
  {
    占问: '025占乡试中否',
    占类: '考试',
    卦主: '父母',
    卦象: '978776',
    月建: '酉',
    日辰: '乙丑',
    旬空: '戌亥',
    用神: '父母未土',
    吉凶: `
    1.用神父母未土，月休，日扶，化进神，化空，吉中带凶
    2.元神官鬼巳火，月囚，回头生，吉
    `,
    应期: '元神回头生，变爻之日建之日',
    细节: '寅日，变爻生元神',
    启示: '动不为真破；动而化破，动二化绝，无可救药',
  },
  {
    占问: '026占官差得否',
    占类: '官运',
    卦主: '官鬼',
    卦象: '797888',
    月建: '丑',
    日辰: '庚子',
    旬空: '辰巳',
    用神: '官鬼寅木',
    吉凶: `
    1.用神官鬼寅木，月囚，日生，化月，吉
    2.世爻兄弟辰土，月扶，旬空，用神克世，凶中带吉
    `,
    应期: '用神动，值日建之日；世爻旬空被克，出空之月',
    细节: '寅日，用神日建，得差；辰月，世爻出空被鬼克，中道而亡',
    启示: '爻变日月得其旺；用神克世，得财，化疾，速归',
  },
  {
    占问: '027占药可能救否',
    占类: '疾病',
    卦主: '世爻',
    卦象: '877777',
    月建: '巳',
    日辰: '丙申',
    旬空: '辰巳',
    用神: '子孙亥水',
    吉凶: `
    1.用神子孙亥水，月破，日生，凶
    2.世爻父母丑土，月生，世克用神，凶
    `,
    应期: '',
    细节: '...',
    启示: '父母持世，妙药难医',
  },
  {
    占问: '028占自病',
    占类: '疾病',
    卦主: '世爻',
    卦象: '877777',
    月建: '巳',
    日辰: '丙申',
    旬空: '辰巳',
    用神: '子孙亥水',
    吉凶: `
    1.用神子孙亥水，月破，日生，凶
    2.世爻父母丑土，月生，世克用神，凶
    `,
    应期: '',
    细节: '...',
    启示: '父母持世，妙药难医',
  },
]
